#+TITLE: Emacs and Org mode
#+AUTHOR: Marcin Mela
#+EMAIL: marcin.mela@gmail.com
#+LANGUAGE: en
#+OPTIONS: H:5 toc:nil
#+SETUPFILE: ./templates/bigblow-remote.setup
#+OPTIONS: h:5

#+ODT_STYLES_FILE: ("templates/template.odt" ("styles.xml" "Pictures/1000020100000640000001EC991BB641.png"))

#+ODT: <text:p text:style-name="PageBreak"/>

#+TOC: headlines 5

#+ODT: <text:p text:style-name="PageBreak"/>


** Spreadsheet

| Student  | Maths | Physics |      Mean |
|----------+-------+---------+-----------|
| Bertrand |     4 |       3 |       3.5 |
| Henri    |     6 |      10 |         8 |
| Arnold   |     2 |       5 |       3.5 |
|----------+-------+---------+-----------|
| Means    |     4 |       6 | 4.8333334 |
#+TBLFM: $4=vmean($2..$3)::@5$2=vmean(@2$2..@4$2)::@5$3=vmean(@2$3..@4$3)

- =C-c ?= :: display field reference
- =C-c }= :: disaply reference grid
- =C-c C-c= :: recalculate formula
- =C-c == :: edit column formula
- =C-u C-c == :: edit field formula

